ci5/app/Controllers/Artikel.php

public function admin_index()
{
$title = 'Daftar Artikel';
$model = new ArtikelModel();
$data = [
'title' => $title,
'artikel' => $model->paginate(3), #data dibatasi 10 record per halaman
---
SELECT *
FROM `artikel`
 LIMIT 3, 3
SELECT COUNT(*) AS `numrows`
FROM `artikel`

    public function delete($id)
    {
        $artikel = new ArtikelModel();
        $artikel->delete($id);
---
DELETE FROM `artikel`
WHERE `id` IN ('7')