ci5/app/Controllers/post.php

INSERT INTO `artikel` (`judul`, `isi`) VALUES ('Artikel-7', 'Apa hubungannya antara Gojek dan kasus dugaan Syahnaz Sadiqah selingkuh? Hal ini tidak lain karena dalam chat yang diduga dikirimkan antara Syahnaz Sadiqah dan Rendy Kjaernett, kedua selebritas ini menggunakan fitur Chat Gojek.')
---
    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi' => $this->request->getVar('isi'),
        ];
        $model->insert($data);